note/emacs-w3m.org
#+TITLE:  如何在emacs中浏览网页?

*1.emacs-w3m安装配置* 

#+BEGIN_QUOTE
在emacs内浏览一些简单的页面可以用[[https://www.archlinux.org/packages/extra/x86_64/w3m/][emacs-w3m]]，enacs-w3m运行需要依赖 [[http://w3m.sourceforge.net/][w3m]]

- 下载安装绿色版免编译w3m

: (add-to-list 'exec-path "/home/manue1/opt/w3m/bin")

- 安装emacs-w3m

安装emacs-w3m前需要安装 =cvs= , =autoconf= 基础工具

下载emacs-w3m可以使用csv下载:

=cvs -d:pserver:anonymous@w3m.cvs.sourceforge.net:/cvsroot/w3m login=

它会要求你输入密码，直接回车即可。然后在输入下面的命令：

=cvs -d:pserver:anonymous@w3m.cvs.sourceforge.net:/cvsroot/w3m checkout w3m=

进去emacs-w3m目录,编译安装

: autoconf
: ./configure
: sudo make 
: sudo make install


- 添加elisp配置

#+BEGIN_SRC 
(add-to-list 'exec-path "/home/manue1/opt/w3m/bin")
;; 默认显示图片
(setq w3m-default-display-inline-images t)
(setq w3m-default-toggle-inline-images t)
;;显示图标
(setq w3m-show-graphic-icons-in-header-line t)
(setq w3m-show-graphic-icons-in-mode-line t)
#+END_SRC


最后，进入emacs，输入M-x w3m,即可看到w3m界面

快速使用emacs-w3m访问一个页面 : *c-c c-o*

#+END_QUOTE

*2.chrome访问url配置*

#+BEGIN_QUOTE

#+BEGIN_SRC 
(add-to-list 'exec-path "/opt/google/chrome")

(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "chrome")
#+END_SRC

快速使用chrome访问一个页面 : *c-x c-o*

#+END_QUOTE



* TODO *3.w3m快捷键*

C-u S g 

| arg  | des                         |
|------+-----------------------------|
| g    | google search               |
|------+-----------------------------|
| q    | site: stackoverflow         |
|------+-----------------------------|
| s    | filetype:el                 |
|------+-----------------------------|
| w    | wikipedia search            |
|------+-----------------------------|
| d    | dictionary.reference.com    |
|------+-----------------------------|
| java | google q=java               |
|------+-----------------------------|
| f    | financial-dictionary        |
|------+-----------------------------|
| j    | js in developer.morilla.org |
|------+-----------------------------|


  
*w3m mode*

 h 打开 w3m 使用快捷键说明·  

|          |                                |
|----------+--------------------------------|
| c-c b /M | 使用默认浏览器浏览网页图片视频 |
|----------+--------------------------------|
| Tab      | 下一个链接                     |
|----------+--------------------------------|
| l        | 前一个访问记录                 |
|----------+--------------------------------|
| n        | 后一个访问记录                 |
|----------+--------------------------------|
| g        | open url in this buffer        |
|----------+--------------------------------|
| G        | open url in new buffer         |
|----------+--------------------------------|
| o        | history                        |
|----------+--------------------------------|
| c-c c-w  | close tab                      |
|----------+--------------------------------|
|          |                                |
