note/emacs-w3m.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-24 Thu 23:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>如何在emacs中浏览网页?</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="manue1" />
<link rel="stylesheet" type="text/css" href="https://www.manue1.site/css/style.css" />
<!-- <link rel="stylesheet" type="text/css" href="http://www.langdebuqing.com/css/style.css" /> -->
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.site">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">如何在emacs中浏览网页?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb790d08">1. <span class="todo TODO">TODO</span> <b>3.w3m快捷键</b></a></li>
</ul>
</div>
</div>
<p>
<b>1.emacs-w3m安装配置</b> 
</p>

<blockquote>
<p>
在emacs内浏览一些简单的页面可以用<a href="https://www.archlinux.org/packages/extra/x86_64/w3m/">emacs-w3m</a>，enacs-w3m运行需要依赖 <a href="http://w3m.sourceforge.net/">w3m</a>
</p>

<ul class="org-ul">
<li>下载安装绿色版免编译w3m</li>
</ul>

<pre class="example">
(add-to-list 'exec-path "/home/manue1/opt/w3m/bin")

</pre>

<ul class="org-ul">
<li>安装emacs-w3m</li>
</ul>

<p>
安装emacs-w3m前需要安装 <code>cvs</code> , <code>autoconf</code> 基础工具
</p>

<p>
下载emacs-w3m可以使用csv下载:
</p>

<p>
<code>cvs -d:pserver:anonymous@w3m.cvs.sourceforge.net:/cvsroot/w3m login</code>
</p>

<p>
它会要求你输入密码，直接回车即可。然后在输入下面的命令：
</p>

<p>
<code>cvs -d:pserver:anonymous@w3m.cvs.sourceforge.net:/cvsroot/w3m checkout w3m</code>
</p>

<p>
进去emacs-w3m目录,编译安装
</p>

<pre class="example">
autoconf
./configure
sudo make 
sudo make install

</pre>


<ul class="org-ul">
<li>添加elisp配置</li>
</ul>

<pre class="example">
(add-to-list 'exec-path "/home/manue1/opt/w3m/bin")
;; 默认显示图片
(setq w3m-default-display-inline-images t)
(setq w3m-default-toggle-inline-images t)
;;显示图标
(setq w3m-show-graphic-icons-in-header-line t)
(setq w3m-show-graphic-icons-in-mode-line t)
</pre>


<p>
最后，进入emacs，输入M-x w3m,即可看到w3m界面
</p>

<p>
快速使用emacs-w3m访问一个页面 : <b>c-c c-o</b>
</p>
</blockquote>

<p>
<b>2.chrome访问url配置</b>
</p>

<blockquote>
<p>

</p>

<pre class="example">
(add-to-list 'exec-path "/opt/google/chrome")

(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "chrome")
</pre>

<p>
快速使用chrome访问一个页面 : <b>c-x c-o</b>
</p>
</blockquote>



<div id="outline-container-orgb790d08" class="outline-2">
<h2 id="orgb790d08"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> <b>3.w3m快捷键</b></h2>
<div class="outline-text-2" id="text-1">
<p>
C-u S g 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">arg</th>
<th scope="col" class="org-left">des</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">g</td>
<td class="org-left">google search</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">q</td>
<td class="org-left">site: stackoverflow</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">s</td>
<td class="org-left">filetype:el</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">w</td>
<td class="org-left">wikipedia search</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">d</td>
<td class="org-left">dictionary.reference.com</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">java</td>
<td class="org-left">google q=java</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">f</td>
<td class="org-left">financial-dictionary</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">j</td>
<td class="org-left">js in developer.morilla.org</td>
</tr>
</tbody>
</table>



<p>
<b>w3m mode</b>
</p>

<p>
h 打开 w3m 使用快捷键说明·  
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c-c b /M</td>
<td class="org-left">使用默认浏览器浏览网页图片视频</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tab</td>
<td class="org-left">下一个链接</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">l</td>
<td class="org-left">前一个访问记录</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">后一个访问记录</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">g</td>
<td class="org-left">open url in this buffer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">G</td>
<td class="org-left">open url in new buffer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">o</td>
<td class="org-left">history</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c-c c-w</td>
<td class="org-left">close tab</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="https://www.manue1.site/css/jquery-2.1.3.min.js"></script>
<script src="https://www.manue1.site/css/main.js"></script>
<!-- <script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
     <script src="http://www.langdebuqing.com/css/main.js"></script> -->
</div>
</body>
</html>